--- core/src/lib.rs
+++ replace StdDev::two -> Self with Default::default()
@@ -567,17 +567,17 @@
 
     /// Creates a `StdDev` of 1.5.
     pub fn one_and_a_half() -> Self {
         Self(1.5)
     }
 
     /// Creates a `StdDev` of 2.0.
     pub fn two() -> Self {
-        Self(2.0)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Creates a `StdDev` of 2.5.
     pub fn two_and_a_half() -> Self {
         Self(2.5)
     }
 
     /// Creates a `StdDev` of 3.0.
