--- core/src/lib.rs
+++ replace StdDev::four -> Self with Default::default()
@@ -582,17 +582,17 @@
 
     /// Creates a `StdDev` of 3.0.
     pub fn three() -> Self {
         Self(3.0)
     }
 
     /// Creates a `StdDev` of 4.0.
     pub fn four() -> Self {
-        Self(4.0)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Creates a custom `StdDev` if within (0.0, 10.0).
     pub fn custom(value: f32) -> Option<Self> {
         Self::new(value)
     }
 
     /// Retrieves the standard deviation value.
