--- core/src/lib.rs
+++ replace StdDev::value -> f32 with -1.0
@@ -592,17 +592,17 @@
 
     /// Creates a custom `StdDev` if within (0.0, 10.0).
     pub fn custom(value: f32) -> Option<Self> {
         Self::new(value)
     }
 
     /// Retrieves the standard deviation value.
     pub fn value(&self) -> f32 {
-        self.0
+        -1.0 /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Base trait for all metrics used in telemetry and Prometheus.
 pub trait Metric: PartialEq {}
 
 /// Trait for metrics suitable for data channels.
 pub trait DataMetric: Metric {}
