--- core/src/lib.rs
+++ replace SteadyRunner::with_default_actor_stack_size -> Self with Default::default()
@@ -726,18 +726,17 @@
             keep_count,
             delete_old_on_start,
         });
         self
     }
 
     /// Sets the default actor stack size for the graph.
     pub fn with_default_actor_stack_size(mut self, size: usize) -> Self {
-        self.default_actor_stack_size = Some(size);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sets the size of the shutdown barrier for the graph.
     pub fn with_shutdown_barrier(mut self, size: usize) -> Self {
         self.barrier_size = Some(size);
         self
     }
 
