--- core/src/lib.rs
+++ replace SteadyRunner::with_telemetry_rate_ms -> Self with Default::default()
@@ -738,18 +738,17 @@
     /// Sets the size of the shutdown barrier for the graph.
     pub fn with_shutdown_barrier(mut self, size: usize) -> Self {
         self.barrier_size = Some(size);
         self
     }
 
     /// Sets the telemetry rate for the graph.
     pub fn with_telemetry_rate_ms(mut self, ms: u64) -> Self {
-        self.telemetry_rate_ms = Some(ms);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Sets the telemetry top bar colors (primary and secondary hex strings).
     pub fn with_telemetry_colors(mut self, primary_color: &str, secondary_color: &str) -> Self {
         self.telemetry_colors = Some((primary_color.to_string(), secondary_color.to_string()));
         self
     }
 
