--- core/src/lib.rs
+++ replace SteadyRunner::with_bundle_floor_size -> Self with Default::default()
@@ -750,18 +750,17 @@
     /// Sets the telemetry top bar colors (primary and secondary hex strings).
     pub fn with_telemetry_colors(mut self, primary_color: &str, secondary_color: &str) -> Self {
         self.telemetry_colors = Some((primary_color.to_string(), secondary_color.to_string()));
         self
     }
 
     /// Sets the bundle floor size for the graph.
     pub fn with_bundle_floor_size(mut self, size: usize) -> Self {
-        self.bundle_floor_size = Some(size);
-        self
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Spawns a guarded thread, initializes a production graph, and executes the provided closure.
     /// The result (including errors) from the closure is propagated back to the caller as a boxed,
     /// thread-safe error. Panics in the thread are unwound (propagated) to the calling thread.
     pub fn run<A, F>(
         self,
         args: A,
