--- core/src/telemetry/metrics_collector.rs
+++ replace MetricsCollector::internal_behavior -> Result<(), Box<dyn std::error::Error>> with Ok(())
@@ -95,189 +95,17 @@
     pub async fn run(self, context: SteadyContext) -> Result<(), Box<dyn std::error::Error>> {
         // CRITICAL: MetricsCollector must use the raw SteadyActorShadow (context) to avoid telemetry
         // feedback loops and prevent this internal actor from appearing in user-facing charts.
         // Also we move this to heap in case we have a giant graph
         Box::pin(self.internal_behavior(context)).await
     }
     /// The main loop for the `MetricsCollector` actor.
     pub async fn internal_behavior(mut self, mut context: SteadyContext) -> Result<(), Box<dyn std::error::Error>> {
-        let start_time = Instant::now();
-        let runtime_state = context.runtime_state.clone();
-
-        // We stay alive as long as the majority of other actors are still working.
-        // Once all actors except the telemetry system (Collector and Server) have agreed 
-        // to shut down, we cast our 'yes' vote by returning true from this closure, 
-        // which terminates the loop. This ensures we capture the final telemetry 
-        // from all worker actors before we exit.
-        while context.is_running(|| {
-            runtime_state.read().is_shutdown_telemetry_complete(2) //for collector and server
-        }) {
-            self.seq += 1;
-            let now_loop = Instant::now();
-            
-            // Sparse actor status accumulation keyed by actor_id.
-            // We compact before sending so downstream only processes real updates.
-            let mut actor_statuses: Vec<Option<ActorStatus>> = Vec::new();
-            let mut node_defs_to_send = Vec::new();
-            let mut channel_volumes_to_send = Vec::new();
-            let mut dot_subtitle_updates: Vec<(usize, Option<String>)> = Vec::new();
-
-            // 1. GATHER PHASE: Acquire the read lock, collect data into local buffers, and release.
-            // CRITICAL: We must NOT perform any .await operations (like send_async) while holding 
-            // this lock, as it can lead to deadlocks with actors attempting to register themselves.
-            {
-                let receivers = self.all_telemetry_rx.read();
-                let len = receivers.len();
-                if len > 0 {
-                    let chunk_size = 250; // Process a manageable slice per frame
-                    for i in 0..chunk_size.min(len) {
-                        let idx = (self.cursor + i) % len;
-                        let detail = &receivers[idx];
-
-                        if detail.ident.label.name == metrics_collector::NAME ||
-                            detail.ident.label.name == metrics_server::NAME {
-                            continue; //skip internal system actors
-                        }
-
-                        let actor_id = detail.ident.id;
-
-                        // Ensure tracking vectors are large enough for this actor_id
-                        if actor_id >= self.sent_node_def.len() {
-                            self.sent_node_def.resize(actor_id + 1, false);
-                            self.last_seen.resize(actor_id + 1, start_time);
-                            self.logged_is_quiet.resize(actor_id + 1, false);
-                        }
-
-                        let mut collected_this_time = false;
-                        for rx in detail.telemetry_take.iter() {
-                            let meta = rx.actor_metadata();
-
-                            // Buffer NodeDef if this is a new actor
-                            if !self.sent_node_def[actor_id] {
-                                self.sent_node_def[actor_id] = true;
-                                node_defs_to_send.push(DiagramData::NodeDef(
-                                    self.seq, 
-                                    Box::new((
-                                        meta.clone(), 
-                                        rx.rx_channel_id_vec().into_boxed_slice(), 
-                                        rx.tx_channel_id_vec().into_boxed_slice()
-                                    ))
-                                ));
-                            }
-
-                            // Collect Actor Status
-                            if let Some(status) = rx.consume_actor() {
-                                if actor_id >= actor_statuses.len() {
-                                    actor_statuses.resize_with(actor_id + 1, || None);
-                                }
-                                self.last_seen[actor_id] = now_loop;
-                                actor_statuses[actor_id] = Some(status);
-                                collected_this_time = true;
-                            }
-
-                            if let Some(upd) = rx.consume_dot_subtitle() {
-                                dot_subtitle_updates.push((meta.ident.id, upd));
-                            }
-
-                            // Collect Channel Volume into persistent buffers
-                            let rx_metas = rx.rx_channel_id_vec();
-                            let tx_metas = rx.tx_channel_id_vec();
-                            let max_id = rx_metas.iter().chain(tx_metas.iter())
-                                .map(|m| m.id).max().unwrap_or(0);
-                            
-                            if max_id >= self.take_send_source.len() {
-                                self.take_send_source.resize(max_id + 1, (0i64, 0i64));
-                                self.future_take.resize(max_id + 1, 0i64);
-                                self.future_send.resize(max_id + 1, 0i64);
-                            }
-
-                            rx.consume_take_into(&mut self.take_send_source, &mut self.future_take, &mut self.future_send);
-                            rx.consume_send_into(&mut self.take_send_source, &mut self.future_send);
-
-                            // Record sparse updates for the channels belonging to this actor
-                            for m in rx_metas.iter().chain(tx_metas.iter()) {
-                                let (t, s) = self.take_send_source[m.id];
-                                channel_volumes_to_send.push((m.id, t, s));
-                            }
-                        }
-
-                        // Detect Stalls (Default 20s timeout)
-                        if !collected_this_time {
-                            let last_time = self.last_seen[actor_id];
-                            if now_loop.duration_since(last_time) > Duration::from_secs(20) {
-                                if actor_id >= actor_statuses.len() {
-                                    actor_statuses.resize_with(actor_id + 1, || None);
-                                }
-                                actor_statuses[actor_id] = Some(ActorStatus {
-                                    ident: detail.ident,
-                                    is_quiet: true,
-                                    ..ActorStatus::default()
-                                });
-                                
-                                if !self.logged_is_quiet[actor_id] {
-                                    //NOT a bug, just something to watch
-                                    trace!("Actor {:?} (ID {}) appears to be quiet (no update for {:?})", detail.ident.label, actor_id, now_loop.duration_since(last_time));
-                                    self.logged_is_quiet[actor_id] = true;
-                                }
-                            }
-                        } else {
-                            self.logged_is_quiet[actor_id] = false;
-                        }
-                    }
-                    self.cursor = (self.cursor + chunk_size) % len;
-                }
-            } // READ LOCK DROPPED HERE
-
-            // 2. TRANSMIT PHASE: Perform async sends now that the registry lock is released.
-            
-            // Send buffered NodeDefs
-            for def in node_defs_to_send {
-                let mut tx_guard = self.targets[0].lock().await;
-                let _ = context.send_async(&mut *tx_guard, def, SendSaturation::AwaitForRoom).await;
-            }
-
-            // Compact sparse actor updates before transmit.
-            // Downstream identifies nodes by status.ident.id (not positional index).
-            let actor_statuses: Vec<ActorStatus> = actor_statuses.into_iter().flatten().collect();
-
-            // Relay batches to server
-            if !actor_statuses.is_empty() {
-                let mut tx_guard = self.targets[0].lock().await;
-                let _ = context.send_async(&mut *tx_guard, DiagramData::NodeProcessData(self.seq, actor_statuses.into_boxed_slice()), SendSaturation::AwaitForRoom).await;
-            }
-            if !dot_subtitle_updates.is_empty() {
-                let mut tx_guard = self.targets[0].lock().await;
-                let _ = context.send_async(
-                    &mut *tx_guard,
-                    DiagramData::NodeDotSubtitle(self.seq, dot_subtitle_updates.into_boxed_slice()),
-                    SendSaturation::AwaitForRoom,
-                )
-                .await;
-            }
-            if !channel_volumes_to_send.is_empty() {
-                let mut tx_guard = self.targets[0].lock().await;
-                let _ = context.send_async(&mut *tx_guard, DiagramData::ChannelVolumeData(self.seq, channel_volumes_to_send.into_boxed_slice()), SendSaturation::AwaitForRoom).await;
-            }
-
-            // CRITICAL: No locks held during periodic wait
-            context.wait_periodic(Duration::from_millis(self.frame_rate_ms)).await;
-        }
-
-        // Explicitly mark all target channels as closed. This is necessary because 
-        // transmitter clones are often held in spawn closures within the Graph registry, 
-        // which prevents automatic closure when this actor is dropped. Marking them 
-        // closed here ensures downstream actors (like the metrics_server) can detect 
-        // the end of the stream and shut down cleanly.
-        for target in self.targets.iter() {
-            let mut guard = target.lock().await;
-            guard.mark_closed();
-        }
-
-        Ok(())
+        Ok(()) /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 pub(crate) mod extra_tests {
     use super::*;
 
     #[test]
